tutorials/DiffusiveGrowth/testing/combinedFullSim/caseDir/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     biofilmYieldFoam;

startFrom       latestTime;

startTime 5404.0;

stopAt          endTime;

endTime 7204.0;

deltaT 10.0;

writeControl runTime;

writeInterval 1800.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep no;

maxCo 0.5;

maxAlphaCo 0.5;

maxDeltaT 10.0;

libs
(
    "libHerschelBulkleySpatial.so"
);



// ************************************************************************* //
