tutorials/DiffusiveGrowth/testing/combinedFullSim/caseDir/system/inletPressure
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");
executeControl  timeStep;
writeControl    timeStep;
writeInterval   1;

regionType      patch;
name            inlet;

operation       areaAverage;
fields          ( p );
writeFields     false;