tutorials/DiffusiveGrowth/testing/combinedFullSim/caseDir/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue tau0 0.0
);

tau0UpperBiofilm 3e-1;
tau0LowerBiofilm 3e-1;

regions
(
    // lower channel
    boxToCell
    {
        box (0.3e-3 0 -1.0e-3) (2.7e-3 0.12e-3 1.0e-3);  // Define your rectangular box

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue tau0    $tau0LowerBiofilm 
        );
    }

    boxToCell
    {
        box (0.3e-3 0.18e-3 -1.0e-3) (2.7e-3 0.3e-3 1.0e-3);  // Define your rectangular box

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue tau0    $tau0LowerBiofilm 
        );
    }

    // upper channel
    boxToCell
    {
        box (0.3e-3 0.7e-3 -1.0e-3) (2.7e-3 1.0e-3 1.0e-3);  // Define your rectangular box

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue tau0    $tau0UpperBiofilm 
        );
    }

    // boxToCell
    // {
    //     box (0.3e-3 0.2e-3 -1.0e-3) (2.7e-3 0.3e-3 1.0e-3);  // Define your rectangular box

    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.water 0
    //         volScalarFieldValue tau0    $tau0UpperBiofilm 
    //     );
    // }
);

